# Data Wrangling Activity

Lex Zedrick M. Lorenzo
4CSC

In [1]:
import numpy as np
import pandas as pd

## Load the csv files

In [2]:
employees_df = pd.read_csv('Data/employees.csv')
departments_df = pd.read_csv('Data/departments.csv')

## Dataframs for employees and departments

In [3]:
employees_df

   Employee_ID     Name  Age Department_ID
0          101    Alice   30          D001
1          102      Bob   35          D002
2          103  Charlie   28          D001
3          104    David   40          D003
4          105      Eve   45          D004

In [4]:
departments_df

  Department_ID Department_Name       Location
0          D001           Sales       New York
1          D002       Marketing         London
2          D003              IT  San Francisco
3          D004              HR      Singapore

## Merge and display the employees and departments dataframe

In [5]:
merged_df = pd.merge(employees_df, departments_df, on='Department_ID')
merged_df

   Employee_ID     Name  Age Department_ID Department_Name       Location
0          101    Alice   30          D001           Sales       New York
1          103  Charlie   28          D001           Sales       New York
2          102      Bob   35          D002       Marketing         London
3          104    David   40          D003              IT  San Francisco
4          105      Eve   45          D004              HR      Singapore

## Create a filtered dataframe where Age > 30 and Location is either in New York or in London

In [6]:
filtered_df = merged_df[
    (merged_df['Age'] > 30) &
    (merged_df['Location'] == 'New York') |
    (merged_df['Location'] == 'London')
]
filtered_df

   Employee_ID Name  Age Department_ID Department_Name Location
2          102  Bob   35          D002       Marketing   London

## Create a summary table that shows the count of employees in each department by location

In [7]:
summary_table = merged_df.pivot_table(
    index=['Department_Name', 'Location'],
    aggfunc='count',
    dropna=True
)
summary_table = summary_table['Employee_ID'].unstack().fillna(0)
summary_table.to_csv('Summary_table.csv')
summary_table

Location         London  New York  San Francisco  Singapore
Department_Name
HR                  0.0       0.0            0.0        1.0
IT                  0.0       0.0            1.0        0.0
Marketing           1.0       0.0            0.0        0.0
Sales               0.0       2.0            0.0        0.0

## Create a new column that categorizes the age of each employee

In [8]:
def age_categorization(row):
    if row < 35:
        return 'Young'
    elif row >= 35 & row <= 45:
        return 'Mid-aged'
    else:
        return 'Senior'
    
merged_df['Age_Group'] = merged_df['Age'].apply(age_categorization)
merged_df = merged_df.sort_values('Age')
merged_df.to_csv('Categorized_Merged_table.csv')
merged_df

,Employee_ID,Name,Age,Department_ID,Department_Name,Location,Age_Group
1,103,Charlie,28,D001,Sales,New York,Young
0,101,Alice,30,D001,Sales,New York,Young
2,102,Bob,35,D002,Marketing,London,Mid-aged
3,104,David,40,D003,IT,San Francisco,Mid-aged
4,105,Eve,45,D004,HR,Singapore,Mid-aged